{
 "essays": [
    {
      "id": "1",
      "title": "Why Major",
      "college": "Carnegie Mellon University",
      "content": "\"General Tso's Chicken or Sesame Chicken?\"\n\nThat used to be the only future I wanted to tell. In 6th grade, I began working at my family’s Japanese restaurant, taking phone orders. With each call, I tried predicting what the customer would order by examining previous orders.\n\nShe ordered this last time, she’ll definitely order it again.\n\nI hoped to not only streamline an ever-changing task within the business, but to also make work easier for my middle school self. Sadly, I wasn’t a chatbot equipped with deep learning capabilities, and my algorithms were not fit for the challenge.\n\nCoding, however, introduced me to a new form of foresight. While preparing for the USA Coding Olympiad, I encountered data structures problems that felt similar to the challenges I faced at the restaurant. Predicting the resultant number of cows in USACO became estimating the number of cucumbers that needed to be sliced each morning.\n\nI saw the value of approximation.\n\nThere may have only been one correct number of cows, but the same principles helped me narrow down the margin for error when predicting volatile variables like inventory costs. My restaurant didn’t need me to envision the next order perfectly. It was more beneficial simply to forecast the movements of erratic variables within a business. I wanted to excel in that role, which brought me to CMU.\n\nI look forward to deepening my understanding of data computing through courses like Parallel and Sequential Data Structures (15-210). Alongside that will be meaningful research at the Parallel Data Laboratory, focused on the incorporation of retrieval augmented generation into large learning models.\n\nBeyond just predicting a day’s expected number of avocados, I hope to create technology that may one day make sense of the most volatile aspects of our economy."
    },
    {
      "id": "2",
      "title": "Why Us",
      "college":"Carnegie Mellon University",
      "content": "\"I’ve always dreamed of opening a fried chicken joint called \"The Fryer.\"\n\nThat dream briefly came true when my parents offered to feature my fried chicken at our restaurant. What followed was a week of chaos: endless oil burns, frazzled nerves, and a $300 deficit. By the end of the experiment, \"The Fryer\" had been fried. \n\nThree years later, those memories resurfaced when I stumbled upon a Google Codewars problem titled \"Dining Delirium.\" As I read the prompt, the scenes replayed in my mind: \n\nFlour. \n\nPaprika. \n\nRaw chicken.\n\nThe coding challenge was straightforward—use algorithms to track prices and ratings—but it illuminated how powerful computing could be for business. Binary searches optimized revenue analysis, and merge sorts transformed customer feedback into actionable data. I realized how much small businesses, like my own, could benefit from these tools.\n\nAt CMU, courses like Logic and Mechanized Reasoning (15-311) will provide experience on advanced tools like SMT and SAT solvers, preparing me to refine and test ML algorithms. Pairing this with Building User-Focused Sensing Systems (17-422), I’ll design a business forecaster that tracks and organizes data on the frontend, and offers actionable AI-driven suggestions from the backend. Participating in events like the Perforated AI Hackathon and Nova will let me apply cutting-edge ML techniques like Perforated Backpropagation and OpenAI’s latest LLMs. I also want to collaborate with Professor Scott Hudson, whom I’ll work with to create more intuitive user interfaces that are essential for attracting buyers. In the Supplier Diversity Program, I hope to partner with various suppliers and receive real-world feedback on my business forecaster, testing and refining my innovations. \n\nToo many small businesses falter due to resource gaps or poor decision-making. At CMU, I’ll bridge computer science and entrepreneurship to create accessible, AI-powered tools that empower businesses like \"The Fryer\" to thrive."

    },
    {
      "id": "3",
      "title": "Community",
      "college": "Carnegie Mellon University",
      "content": "\"I’m a SLUG.\"\n\nNo really, I am—though not the slimy creature that slithers across my lawn in the early morning. SLUG stands for Spiritual Leader Under God, a title bestowed upon us by my church’s youth pastor. \n\nHaving gone to Friday night fellowship most of my life, I experienced firsthand the vast bible knowledge and personal maturity every SLUG demonstrated—traits I believed I lacked. They were pillars that guided me in my walk with God and provided me with wisdom in everyday life. They became my paragons of faith, far beyond my reach. Even after joining, there was always an expanse that separated me from my peers, or so I thought. \n\nMy perspective began to shift as I connected with my fellow SLUGs on a personal level. They struggled with thoughts of worthlessness, battled with pride, and doubted the same Christian virtues they stressed every Friday. What made them ideal leaders was the fact that despite being flawed, they were still willing to serve for the sake of others. Through their vulnerability, my fellow SLUGs helped me become accepting of my own shortcomings. My weakness can be a source of solace and my story can be a light in the darkness for others, just as my seniors were for me. \n\nAt CMU, I will continue to embody this spirit as I serve in the Acts2Fellowship Christian Fellowship. Failure is a natural part of the human experience—I just hope that my own imperfect journey may act as a pillar that my peers can lean on in their faith and daily lives. Even before stepping foot on campus, I can already envision my response when asked how I wish to serve:\"I want to be a SLUG.\" "
    },
    {
      "id": "4",
      "title": "Why Us",
      "college": "Duke University",
      "content": "Color boards? Check. \n\nKatakana chart? Check. \n\nManga panels? No room for error here. \n\nEach author has a unique style and way of expressing their characters. As a \"scanlator,\" it’s my job to interpret their work and bring it to life in English. But how could I render thousands of intricate kanji into just 26 letters without losing their essence? \n\nThe answer lies in adaptive interpretation—uncovering the emotional subtext behind every word to preserve the writer’s intent. This approach has inspired my vision: combining natural language processing with computational linguistics to create seamless, culturally attuned translations. Not only for manga readers like me but for bridging understanding across cultures around the world. Duke provides like-minded courses and research that can help me attain this goal.\n\nAt Duke, courses like Computational Approaches to Human Language (COMPSCI-376) will introduce me to advanced NLP techniques such as Hidden Markov Models and corpora analysis, building upon my current “brute force” translation methods. In Acquisition of Japanese as a Second Language (LINGUIST-315S), I’ll study how linguistic structures align between Japanese and English, using my own bilingual learning journey to inform algorithmic solutions. Through the Rhodes Information Initiative, I hope to contribute to projects like Data Networks of Asian American Literature, designing applications to process and preserve cultural works from diverse societies. \n\nSo much of what connects us is “lost in translation.” With Duke’s resources, I hope to transform my passion for linguistic adaptation into tools that foster cultural relativism—starting with the manga panels on my desk."
    },
    {
      "id": "5",
      "title": "Identity",
      "college": "Duke University",
      "content": "I used to wonder what other kids did on Saturdays. \n\nDid they also go to the neighboring town’s high school, learning pinyin, taking writing quizzes, strategizing over games of go, and then taking karate class? Was this normal? Was I the odd one out for not playing soccer or lacrosse or Mario Kart? \n\nDid choosing to do calligraphy or play ping-pong come at the price of being \"normal?\" I don’t think so. If exploring my heritage made me different, I embraced it wholeheartedly.\n\nThis weekly ritual taught me independence—not only did it encourage self-discipline necessary for balancing academics elsewhere but also fostered courage needed when embracing paths less traveled among friends. Of course there were Saturdays when I longed to go on spontaneous adventures with my friends instead of taking tests, but those urges paled in comparison to feelings of wonder from learning at a place where Mandarin echoed in hallways and tradition came alive. \n\nSince graduating from Chinese school four years ago, I’ve felt its absence. Consequently, this void has allowed me to freely explore deeper aspects within my culture. Ordinary activities like playing go with elderly men at my grandmother’s nursing home have introduced me to their wisdom, stories, and a deeper connection to my roots.\n\nI no longer dwell on how others spend their Saturday, instead focusing on attaining a normalcy that’s grounded in curiosity and cultural enrichment. At Duke, I will be open-minded and strive for intellectual growth without fear of straying from what’s \"normal.\""
    }
  ]
}